/* Joyce
	Event NPC
*/

var status = -1;
var maps = Array(
910001000, //隐藏地图 - 专业技术村庄&lt;匠人街>
230000000, //水下世界 - 水下世界
260000000, //火焰之路 - 阿里安特
101000000, //魔法密林 - 魔法密林
211000000, //神秘岛 - 冰峰雪域
120030000, //黄金海滩 - 海边瓜棚
130000200, //女皇之路 - 圣地岔路
100000000, //射手村 - 射手村
103000000, //废弃都市 - 废弃都市
222000000, //时间静止之湖 - 童话村
240000000, //神木村 - 神木村
104000000, //明珠港 - 明珠港
220000000, //玩具城 - 玩具城
802000101, //逆奥之城 - 卡姆那 （内部）
120000000, //诺特勒斯 - 诺特勒斯码头
221000000, //时间静止之湖 - 地球防御本部
200000000, //神秘岛 - 天空之城
102000000, //勇士部落 - 勇士部落
300000000, //艾琳森林 - 阿尔泰营地
801000000, //昭和村 - 昭和村
540000000, //新加坡 - 中心商务区
541000000, //新加坡 - 驳船码头城
250000000, //武陵 - 武陵
251000000, //百草堂 - 百草堂
551000000, //马来西亚 - 甘榜村
550000000, //马来西亚 - 吉隆大都市 
261000000, //莎翁小镇 - 玛加提亚
541020000, //新加坡 - 乌鲁城入口
270000000, //时间神殿 - 三个门
682000000, //隐藏地图 - 闹鬼宅邸外部
140000000, //冰雪之岛 - 里恩
970010000, //隐藏地图 - 枫树山丘
103040000, //废都广场 - 废都广场大厅
555000000, //M我 - 白色圣诞山丘
310000000, //黑色之翼领地 - 埃德尔斯坦
200100000, //天空中的克里塞 - 克里塞入口
211060000, //狮子王之城 - 沉寂原野
310040300, //干路 - 岩石路
701000000);//上海外滩

var pqMaps = Array(
541000300, //新加坡 - 神秘通道 3 等级：85-100
220050300, //玩具城 - 时间通道
229000020, //闹鬼宅邸 - 客房2
230040200, //水下世界 - 危海峡谷1
541010010, //新加坡 - 幽灵船 2
551030100, //马来西亚 - 阴森世界入口
240040500, //神木村 - 龙之巢穴入口
800020110, //江戶村 - 林野的松林
105030500, //被诅咒的寺院 - 禁忌祭坛
102040200, //遗迹发掘地 - 遗迹发掘团营地
105100100, //蝙蝠怪神殿 - 寺院地下
211041100, //死亡森林
270030500); //忘却之路5

var bossmaps = Array( 
100020401,//僵尸蘑菇的巢穴
100020301,//蓝蘑菇王的巢穴
100020101,//蘑菇王的巢穴  
230040420,//皮亚奴斯洞穴
211042400,//扎昆祭坛入口
220080001,//时间塔的本源
240020402,//喷火龙栖息地
240020102,//格瑞芬的森林   
270050000,//神的黄昏
551030100,//阴森世界
240040700,//暗黑龙王栖息地
702070400);//藏经主场

var selectedMap = -1;
var selectedArea = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 2 || status == 0) {
            cm.dispose();
            return;
        }
        status--;
    }

    if (status == 0) {
        cm.sendSimple("您好 #r#h ##k 有什么需要我帮忙的吗？ \r\n#b#b#L1#学习技能#l#k");
    } else if (status == 1) {
        if (selection == 1) {
	    cm.sendSimple("您好 #r#h ##k 请选择您要操作的项目:\r\n#b#L1#群宠技能#l\r\n#L4#骑宠技能#l\r\n#L5#职业技能全满#l#k");
        }
    } else if (status == 2) {
        if (selection == 1) {
            if (cm.getPlayer().getSkillLevel(8) > 0 || cm.getPlayer().getSkillLevel(10000018) > 0 || cm.getPlayer().getSkillLevel(20000024) > 0 || cm.getPlayer().getSkillLevel(20011024) > 0) {
                cm.sendOk("您已经学习过这个技能。");
            } else {
                if (cm.getJob() == 2001 || (cm.getJob() >= 2200 && cm.getJob() <= 2218)) {
                    cm.teachSkill(20011024, 1, 0); // 龙神 - 群宠
                } else if (cm.getJob() == 2000 || (cm.getJob() >= 2100 && cm.getJob() <= 2112)) {
                    cm.teachSkill(20000024, 1, 0); // 战神 - 群宠
                } else if (cm.getJob() >= 1000 && cm.getJob() <= 1512) {
                    cm.teachSkill(10000018, 1, 0); // 骑士团 - 群宠
                } else {
                    cm.teachSkill(8, 1, 0); // 冒险家 - 群宠
                }
                cm.sendOk("恭喜您学习技能成功。");
            }
            cm.dispose();
        } else if (selection == 4) {
            /*骑兽技能  || cm.getPlayer().getSkillLevel(cm.getPlayer().getStat().getSkillByJob(1004, cm.getPlayer().getJob()))*/
            if (cm.getPlayer().getSkillLevel(80001000) > 0) {
                cm.sendOk("您已经学习过这个技能。");
            } else {
                if (cm.getJob() >= 3000) {
                    cm.sendOk("对不起！该职业暂时无法学习这个技能。");
                    cm.dispose();
                    return;
                }
		cm.teachSkill(80001000 ,  1, 1);
                /*
		cm.teachSkill(cm.isGMS() ? 80001000 : cm.getPlayer().getStat().getSkillByJob(1004, cm.getPlayer().getJob()), 1, 1);*/
                cm.sendOk("恭喜您学习技能成功。");
            }
            cm.dispose();
        } else if (selection == 5) {
            cm.dispose();
            cm.openNpc(9900002,21);
        }
    }
}