/* ===========================================================
			注释(cm.sendSimple\cm.itemQuantity(5420008))
	脚本类型: 		PORTAL
	所在地图:		废都广场B区
	脚本名字:		进入7 ~ 8层C区
=============================================================
制作时间：2010年8月9日 10:30:49
制作人员：笔芯
=============================================================
*/	

function enter(pi) {
	 if (pi.getPlayer().getMap().getId() == 103040420) {
	pi.warp(103040410);	
	 }else if (pi.getPlayer().getMap().getId() == 103040430) {
		 pi.warp(103040420);
	 }
	 return false;	
}
