importPackage(java.util);
importPackage(net.sf.odinms.client);
importPackage(net.sf.odinms.server);

var status = 0;
var typed=0;
var slot = Array();
var stats = Array("Strength", "Dexterity", "Intellect", "Luck", "HP", "MP", "Weapon Attack", "Magic Attack", "Weapon Defense", "Magic Defense", "Accuracy", "Avoidability", "Hands", "Speed", "Jump");
var selected;
var statsSel;
var item = 
Array(
			//-------耳环-------
			Array(1032025,400,1), //叶子耳环
			Array(1032026,400,1), //黄水晶耳环
			Array(1032027,400,1), //黑水晶耳环
			Array(1032028,400,1), //红水晶耳环
			Array(1032035,300,1), //枫叶耳环
			Array(1032040,300,1), //枫叶型耳环
			Array(1032041,300,1), //枫叶型耳环
			Array(1032042,300,1), //枫叶型耳环
			Array(1032047,200,1), //可乐耳环
			Array(1032055,200,1), //工作人员C的旧收信机
			Array(1032056,200,1), //工作人员C的旧收信机
			Array(1032057,200,1), //工作人员C的旧收信机
			Array(1032058,200,1), //工作人员C钛质收信机
			//-------帽子-------
			Array(1002418,100,1), //废报纸头盔
			Array(1002419,300,1), //枫叶帽
			Array(1002424,300,1), //红马术帽
			Array(1002425,300,1), //蓝马术帽
			Array(1002436,300,1), //长老斯坦之帽
			Array(1002441,300,1), //热血头带
			Array(1002448,300,1), //紫色头巾
			Array(1002452,300,1), //黑星白头巾
			Array(1002453,300,1), //白星黑头巾
			Array(1002454,300,1), //红星黑头巾
			Array(1002455,300,1), //黑星红头巾
			Array(1002492,300,1), //白色棒球帽
			Array(1002543,300,1), //板栗帽
			Array(1002550,300,1), //黑色格莱西头盔
			Array(1002551,300,1), //蓝龙头盔
			Array(1002554,300,1), //武艺头绳
			Array(1002562,300,1), //青苹果帽
			Array(1002583,300,1), //蝙蝠客头套
			Array(1002609,300,1), //兔耳魔法帽
			Array(1002610,300,1), //水手头巾
			Array(1002613,300,1), //水手帽
			Array(1002616,300,1), //水兵头巾
			Array(1002619,300,1), //兵长头巾
			Array(1002622,300,1), //水兵帽
			Array(1002625,300,1), //海盗睡帽
			Array(1002628,300,1), //三眼海盗帽
			Array(1002631,300,1), //船头
			Array(1002634,300,1), //骷髅巾
			Array(1002637,300,1), //绞杀包头
			Array(1002640,10,1), //冲锋帽
			Array(1002643,10,1), //血海头巾
			Array(1002656,10,1), //白色忍者头巾
			Array(1002663,10,1), //可乐帽子
			Array(1002665,10,1), //西红柿帽
			Array(1002677,10,1), //玩具匠人帽
			Array(1002695,10,1), //幽灵帽
			Array(1002699,10,1), //南瓜帽子
			Array(1002707,10,1), //假面绅士帽子
			Array(1002711,10,1), //白乖乖猫耳
			Array(1002712,10,1), //黑乖乖猫耳
			Array(1002723,10,1), //月饼帽
			Array(1002760,10,1), //地球帽
			Array(1002761,10,1), //枫叶面具
			Array(1002773,10,1), //金龙头盔
			Array(1002776,10,1), //永恒冠军盔
			Array(1002777,10,1), //永恒玄妙帽
			Array(1002778,10,1), //永恒霓翎帽
			Array(1002779,10,1), //永恒迷踪帽
			Array(1002780,10,1), //永恒海王星
			Array(1002790,10,1), //重生冠军盔
			Array(1002791,10,1), //重生玄妙帽
			Array(1002792,10,1), //重生霓翎帽
			Array(1002793,10,1), //重生迷踪帽
			Array(1002794,10,1), //重生海王星
			//------披风------
			Array(1102029,300,1), //白妖精披风
			Array(1102030,300,1), //黑妖精披风
			Array(1102031,300,1), //绿龙纹披风
			Array(1102032,300,1), //紫龙纹披风
			Array(1102033,300,1), //红龙纹披风
			Array(1102034,300,1), //蓝龙纹披风
			Array(1102035,300,1), //黑龙纹披风
			Array(1102040,100,1), //浪人披风(黄)
			Array(1102041,100,1), //浪人披风(粉)
			Array(1102042,100,1), //浪人披风(紫)
			Array(1102043,100,1), //浪人披风(褐)
			Array(1102046,30,1), //侯爵披风
			Array(1102047,20,1), //伯爵披风
			Array(1102048,10,1), //公爵披风
			Array(1102140,20,1), //卡帕莱特披风
			Array(1102147,20,1), //玩具匠人披风
			Array(1102172,10,1), //永恒不灭披风
			Array(1102174,100,1), //工作人员披风
			Array(1102166,100,1), //枫叶披风
			Array(1102167,100,1), //枫叶披风
			Array(1102168,100,1), //枫叶披风
			//------手套------
			Array(1082108,300,1), //黑神眼手套
			Array(1082109,300,1), //红天使手套
			Array(1082110,300,1), //蓝天使手套
			Array(1082111,300,1), //绿天使手套
			Array(1082112,300,1), //黑天使手套
			Array(1082114,300,1), //马尔斯蓝拳套
			Array(1082115,300,1), //马尔斯绿拳套
			Array(1082116,300,1), //马尔斯红拳套
			Array(1082117,300,1), //马尔斯黑拳套
			Array(1082118,300,1), //德古拉蓝手套
			Array(1082119,300,1), //德古拉紫手套
			Array(1082120,300,1), //德古拉红手套
			Array(1082121,300,1), //魔力绿手套
			Array(1082122,300,1), //魔力蓝手套
			Array(1082123,300,1), //魔力青手套
			Array(1082125,300,1), //弦影手套(红)
			Array(1082126,300,1), //弦影手套(绿)
			Array(1082127,300,1), //弦影手套(黑)
			Array(1082128,300,1), //裂天手套(绿)
			Array(1082129,300,1), //裂天手套(紫)
			Array(1082130,300,1), //裂天手套(紫)
			Array(1082131,300,1), //杰斯特手套(蓝)
			Array(1082132,300,1), //杰斯特手套(绿)
			Array(1082133,300,1), //杰斯特手套(红)
			Array(1082134,300,1), //杰斯特手套(黑)
			Array(1082135,300,1), //侠盗手套(蓝)
			Array(1082136,300,1), //侠盗手套(绿)
			Array(1082137,300,1), //侠盗手套(红)
			Array(1082138,300,1), //侠盗手套(黑)
			Array(1082139,300,1), //混天手套(黄)
			Array(1082140,300,1), //混天手套(紫)
			Array(1082141,300,1), //混天手套(褐)
			Array(1082142,300,1), //幻光手套(蓝)
			Array(1082143,300,1), //幻光手套(紫)
			Array(1082144,300,1), //幻光手套(红)
			Array(1082145,100,1), //工地手套(黄)
			Array(1082146,100,1), //工地手套(红)
			Array(1082147,100,1), //工地手套(蓝)
			Array(1082148,100,1), //工地手套(紫)
			Array(1082149,100,1), //工地手套(褐)
			Array(1082150,100,1), //工地手套(灰)
			Array(1082151,50,1), //幻魔手套(绿)
			Array(1082152,50,1), //幻魔手套(蓝)
			Array(1082153,50,1), //幻魔手套(红)
			Array(1082154,50,1), //幻魔手套(黑)
			Array(1082158,300,1), //红色条纹手套
			Array(1082159,300,1), //蓝色条纹手套
			Array(1082160,300,1), //绿色条纹手套
			Array(1082163,300,1), //红猎人手套
			Array(1082164,300,1), //蓝色元素手套
			Array(1082167,300,1), //黑色格丽纳手套
			Array(1082168,300,1), //青龙手套
			Array(1082175,300,1), //马绍尔手套(赤)
			Array(1082176,300,1), //马绍尔手套(青)
			Array(1082177,300,1), //马绍尔手套(紫
			Array(1082178,300,1), //马绍尔手套(桃)
			Array(1082179,300,1), //马绍尔手套(黄)
			Array(1082234,10,1), //永恒定边手套
			Array(1082235,10,1), //永恒逍遥手套
			Array(1082236,10,1), //永恒白云手套
			Array(1082237,10,1), //永恒探云手套
			Array(1082238,10,1), //永恒抚浪手套
			Array(1082239,10,1), //重生定边手套
			Array(1082240,10,1), //重生逍遥手套
			Array(1082241,10,1), //重生白云手套
			Array(1082242,10,1), //重生探云手套
			Array(1082243,10,1), //重生抚浪手套
			//-------武器------
			Array(1302016,300,1), //黄色雨伞
			Array(1302049,300,1), //光线鞭子
			Array(1302050,300,1), //战剑
			Array(1302051,300,1), //树灵之剑
			Array(1302052,300,1), //奇型刀
			Array(1302053,300,1), //奇型刀
			Array(1302054,300,1), //汤勺
			Array(1302056,300,1), //一刀两断
			Array(1302058,300,1), //冒险岛伞
			Array(1302059,300,1), //狂龙闪电剑
			Array(1302060,300,1), //战剑
			Array(1302061,300,1), //蔓藤鞭子
			Array(1302063,300,1), //燃烧的火焰刀
			Array(1302064,300,1), //枫叶突击剑
			Array(1302066,300,1), //枫叶3年旗
			Array(1302067,300,1), //枫叶庆典旗
			Array(1302068,300,1), //薄光刃
			Array(1302071,300,1), //粉色花边游泳圈
			Array(1302077,300,1), //新手战士之剑
			Array(1302080,300,1), //七彩霓虹灯泡
			Array(1302081,10,1), //永恒破甲剑
			Array(1302084,300,1), //火柴
			Array(1302085,300,1), //叉子
			Array(1302086,10,1), //重生破甲剑
			Array(1302087,300,1), //火炬
			Array(1302104,300,1), //鱿鱼剑
			Array(1302105,10,1), //圣诞六翼天使武器(单手剑)
			Array(1312030,300,1), //烛影摇红
			Array(1312031,300,1), //狂龙怒斩
			Array(1312032,300,1), //枫叶破击斧
			Array(1312033,300,1), //枫叶3年旗
			Array(1312034,300,1), //粉色花边游泳圈
			Array(1312037,10,1), //永恒断蚺斧
			Array(1312038,10,1), //重生断蚺斧
			Array(1312039,10,1), //圣诞六翼天使武器(单手斧)
			Array(1322000,300,1), //铁瓜锤
			Array(1322001,300,1), //锤子
			Array(1322002,300,1), //钢锤
			Array(1322003,300,1), //棒棒果
			Array(1322004,300,1), //奇型锤
			Array(1322005,300,1), //棍棒
			Array(1322006,300,1), //钢管
			Array(1322007,300,1), //皮制手提包
			Array(1322008,300,1), //007提包
			Array(1322009,100,1), //马桶吸
			Array(1322010,300,1), //方形铁铲
			Array(1322011,300,1), //三角铁铲
			Array(1322012,100,1), //红色砖头
			Array(1322014,300,1), //大战斗锤
			Array(1322015,300,1), //骑士锤
			Array(1322016,300,1), //重锤
			Array(1322017,300,1), //旋风锤
			Array(1322018,300,1), //巨型锤
			Array(1322019,300,1), //暴风锤
			Array(1322020,300,1), //黄金暴风锤
			Array(1322021,300,1), //黑游泳圈
			Array(1322022,300,1), //红花纹游泳圈
			Array(1322023,300,1), //蓝花纹游泳圈
			Array(1322024,300,1), //紫游泳圈
			Array(1322025,300,1), //救命游泳圈
			Array(1322026,300,1), //彩虹游泳圈
			Array(1322027,10,1), //米伽勒的平底锅
			Array(1322028,300,1), //钉头锤
			Array(1322029,300,1), //雷神钉
			Array(1322031,300,1), //葵花宝典
			Array(1322032,300,1), //铁头锤
			Array(1322033,300,1), //鬼怪棒
			Array(1322034,300,1), //铁棍
			Array(1322035,300,1), //大战斗锤
			Array(1322036,300,1), //旋风锤
			Array(1322037,300,1), //巨型锤
			Array(1322038,300,1), //暴风锤
			Array(1322051,300,1), //七夕
			Array(1322052,300,1), //狂龙地锤
			Array(1322054,300,1), //枫叶地震锤
			Array(1322055,300,1), //枫叶3年旗
			Array(1322056,300,1), //粉色花边游泳圈
			Array(1322060,10,1), //永恒惊破天
			Array(1322061,10,1), //重生惊破天
			Array(1322065,10,1), //圣诞六翼天使武器(单手钝器)
			Array(1332026,300,1), //闪电刃
			Array(1332027,300,1), //飞羽刃
			Array(1332028,300,1), //烈焰之刃
			Array(1332029,300,1), //双古剑
			Array(1332030,300,1), //团扇
			Array(1332031,300,1), //龙刃
			Array(1332032,300,1), //圣诞树
			Array(1332033,300,1), //水晶刃
			Array(1332034,300,1), //破碎刃
			Array(1332035,300,1), //双翼刃
			Array(1332036,300,1), //凤凰刃
			Array(1332037,300,1), //黑精灵拳刃
			Array(1332038,300,1), //水晶刃
			Array(1332039,300,1), //破碎刃
			Array(1332040,300,1), //双翼刃
			Array(1332041,300,1), //凤凰刃
			Array(1332042,300,1), //黑精灵拳刃
			Array(1332043,300,1), //水晶刃
			Array(1332044,300,1), //破碎刃
			Array(1332045,300,1), //双翼刃
			Array(1332046,300,1), //凤凰刃
			Array(1332047,300,1), //黑精灵拳刃
			Array(1332049,300,1), //蝉翼龙牙破
			Array(1332050,300,1), //半月龙鳞裂
			Array(1332051,300,1), //黄金双牙钩
			Array(1332052,300,1), //阴风碎魂刃
			Array(1332053,300,1), //野外烧烤串
			Array(1332054,300,1), //闪电飞刀
			Array(1332055,300,1), //枫叶锁魄铗
			Array(1332056,300,1), //枫叶追魂刺
			Array(1332057,300,1), //枫叶3年旗
			Array(1332059,300,1), //粉色花边游泳圈
			Array(1332063,300,1), //初级盗贼的短剑
			Array(1332066,300,1), //新手刮胡刀
			Array(1332073,10,1), //永恒狂鲨锯
			Array(1332074,10,1), //永恒断首刃
			Array(1332075,10,1), //重生狂鲨锯
			Array(1332076,10,1), //重生断首刃
			Array(1332081,10,1), //圣诞六翼天使武器(短剑)
			Array(1372008,300,1), //金属短杖
			Array(1372009,300,1), //慈悲为怀
			Array(1372010,300,1), //嗜魂法杖
			Array(1372011,300,1), //羽扇
			Array(1372012,300,1), //水晶短杖
			Array(1372013,300,1), //竹杖
			Array(1372014,300,1), //火焰之杖
			Array(1372015,300,1), //天使之翼
			Array(1372016,300,1), //凤凰短杖
			Array(1372017,300,1), //领路灯
			Array(1372018,300,1), //法师短杖
			Array(1372019,300,1), //大魔法师短杖
			Array(1372020,300,1), //火焰之杖
			Array(1372021,300,1), //天使之翼
			Array(1372022,300,1), //法师短杖
			Array(1372023,300,1), //大魔法师短杖
			Array(1372024,300,1), //火焰之杖
			Array(1372025,300,1), //天使之翼
			Array(1372027,300,1), //法师短杖
			Array(1372028,300,1), //大魔法师短杖
			Array(1372029,300,1), //火焰之杖
			Array(1372030,300,1), //天使之翼
			Array(1372031,300,1), //圣贤短杖
			Array(1372032,300,1), //佘太君龙杖
			Array(1372033,300,1), //圣贤短杖
			Array(1372034,300,1), //枫叶仙姬杖
			Array(1372035,300,1), //火灵珠短杖
			Array(1372036,300,1), //毒灵珠短杖
			Array(1372037,300,1), //冰灵珠短杖
			Array(1372038,300,1), //雷灵珠短杖
			Array(1372039,300,1), //爆炎之杖
			Array(1372040,300,1), //剧毒之杖
			Array(1372041,300,1), //寒冰之杖
			Array(1372042,300,1), //狂雷之杖
			Array(1372043,300,1), //初级魔法师的杖
			Array(1372044,10,1), //永恒蝶翼杖
			Array(1372045,10,1), //重生蝶翼杖
			Array(1372046,10,1), //圣诞六翼天使武器(短杖)
			Array(1382000,300,1), //木制长杖
			Array(1382001,300,1), //精灵长杖
			Array(1382002,300,1), //法师长杖
			Array(1382003,300,1), //蓝宝石长杖
			Array(1382004,300,1), //古树长杖
			Array(1382005,300,1), //祖母綠长杖
			Array(1382006,300,1), //白龙之杖
			Array(1382007,300,1), //魔灵之翼
			Array(1382008,300,1), //魔灵之魂
			Array(1382009,300,1), //枫叶权杖
			Array(1382010,300,1), //死灵法杖
			Array(1382011,300,1), //枫树杖
			Array(1382012,300,1), //枫叶杖
			Array(1382013,300,1), //烈焰之杖
			Array(1382014,300,1), //孙家之杖
			Array(1382015,10,1), //毒蘑菇
			Array(1382016,10,1), //香菇
			Array(1382017,300,1), //金轮杖
			Array(1382018,300,1), //翡翠之杖
			Array(1382019,300,1), //护法之杖
			Array(1382020,300,1), //精灵长杖
			Array(1382021,300,1), //白龙之杖
			Array(1382022,300,1), //魔灵之翼
			Array(1382023,300,1), //死灵法杖
			Array(1382024,300,1), //魔灵之魂
			Array(1382025,300,1), //精灵长杖
			Array(1382026,300,1), //白龙之杖
			Array(1382027,300,1), //魔灵之翼
			Array(1382028,300,1), //死灵法杖
			Array(1382029,300,1), //魔灵之魂
			Array(1382030,300,1), //精灵长杖
			Array(1382031,300,1), //白龙之杖
			Array(1382032,300,1), //魔灵之翼
			Array(1382033,300,1), //死灵法杖
			Array(1382034,300,1), //魔灵之魂
			Array(1382035,300,1), //冰肌玲珑杖
			Array(1382036,300,1), //黑精灵王杖
			Array(1382037,300,1), //偃月之杖
			Array(1382039,300,1), //枫叶丹心杖
			Array(1382040,300,1), //枫叶3年旗
			Array(1382041,300,1), //夜行權杖
			Array(1382042,300,1), //粉色花边游泳圈
			Array(1382045,300,1), //火灵珠长杖
			Array(1382046,300,1), //毒灵珠长杖
			Array(1382047,300,1), //冰灵珠长杖
			Array(1382048,300,1), //雷灵珠长杖
			Array(1382049,10,1), //朱雀长杖
			Array(1382050,10,1), //玄武长杖
			Array(1382051,10,1), //白虎长杖
			Array(1382052,10,1), //青龙长杖
			Array(1382057,10,1), //永恒冰轮杖
			Array(1382059,10,1), //重生冰轮杖
			Array(1382062,10,1), //圣诞六翼天使武器(长杖)
			Array(1402006,300,1), //高原之剑
			Array(1402007,300,1), //半月巨刀
			Array(1402008,300,1), //钢铁剑
			Array(1402009,300,1), //木球棍
			Array(1402010,300,1), //铝球棍
			Array(1402011,300,1), //无极剑
			Array(1402012,300,1), //霸王剑
			Array(1402013,300,1), //白日剑
			Array(1402014,10,1), //温度计
			Array(1402015,300,1), //亚历山大之剑
			Array(1402016,300,1), //所罗门之剑
			Array(1402017,300,1), //船长佩剑
			Array(1402018,300,1), //幻木剑
			Array(1402019,300,1), //大刀
			Array(1402020,300,1), //虎剑
			Array(1402021,300,1), //无极剑
			Array(1402022,300,1), //霸王剑
			Array(1402023,300,1), //亚历山大之剑
			Array(1402024,300,1), //大刀
			Array(1402025,300,1), //虎剑
			Array(1402026,300,1), //无极剑
			Array(1402027,300,1), //霸王剑
			Array(1402028,300,1), //亚历山大之剑
			Array(1402029,300,1), //鬼刺狼牙棒
			Array(1402030,300,1), //大刀
			Array(1402031,300,1), //虎剑
			Array(1402032,300,1), //无极剑
			Array(1402033,300,1), //霸王剑
			Array(1402034,300,1), //亚历山大之剑
			Array(1402035,300,1), //斩天刀
			Array(1402036,300,1), //飞龙巨剑
			Array(1402037,50,1), //龙背刃
			Array(1402039,300,1), //枫叶枭首剑
			Array(1402040,300,1), //枫叶3年旗
			Array(1402041,300,1), //粉色花边游泳圈
			Array(1402044,300,1), //南瓜灯笼
			Array(1402046,10,1), //永恒玄冥剑
			Array(1402047,10,1), //重生玄冥剑
			Array(1402053,10,1), //圣诞六翼天使武器(双手剑)
			Array(1412000,300,1), //双手斧
			Array(1412001,300,1), //铁斧
			Array(1412002,300,1), //钢铁斧
			Array(1412003,300,1), //太阳之斧
			Array(1412004,300,1), //绿蛇刀
			Array(1412005,300,1), //格斗斧
			Array(1412006,300,1), //重型巨斧
			Array(1412007,300,1), //光明斧
			Array(1412008,300,1), //雷电斧
			Array(1412009,300,1), //大力神之斧
			Array(1412021,300,1), //龙魂祭
			Array(1412022,300,1), //太阳之斧
			Array(1412023,300,1), //光明斧
			Array(1412024,300,1), //雷电斧
			Array(1412025,300,1), //大力神之斧
			Array(1412026,300,1), //炼狱魔龙斧
			Array(1412027,300,1), //枫叶乾坤轮
			Array(1412028,300,1), //枫叶3年旗
			Array(1412029,300,1), //粉色花边游泳圈
			Array(1412033,10,1), //永恒碎鼋斧
			Array(1412034,10,1), //重生碎鼋斧
			Array(1412035,10,1), //圣诞六翼天使武器(双手斧)
			Array(1422004,300,1), //板手
			Array(1422005,300,1), //黄金锤
			Array(1422006,300,1), //十字镐
			Array(1422007,300,1), //巨人锤
			Array(1422008,300,1), //大锤
			Array(1422009,300,1), //妖精之锤
			Array(1422010,300,1), //封魂之锤
			Array(1422011,300,1), //酒瓶
			Array(1422012,300,1), //雷神之锤
			Array(1422013,300,1), //狮子之魂
			Array(1422014,300,1), //枫叶锤
			Array(1422015,300,1), //黄金锤
			Array(1422028,300,1), //金龙轰天锤
			Array(1422029,300,1), //枫叶轰天镗
			Array(1422030,100,1), //粉红海豹抱枕
			Array(1422031,100,1), //蓝色海豹抱枕
			Array(1422032,300,1), //枫叶3年旗
			Array(1422033,300,1), //粉色花边游泳圈
			Array(1422036,300,1), //玩具匠人的锤子
			Array(1422037,10,1), //永恒威震天
			Array(1422038,10,1), //重生威震天
			Array(1422039,10,1), //圣诞六翼天使武器(双手钝器)
			Array(1432028,300,1), //奥丁手戟
			Array(1432030,300,1), //红莲落神枪
			Array(1432031,300,1), //三支枪
			Array(1432032,300,1), //长八蛇矛
			Array(1432033,300,1), //十字枪
			Array(1432034,300,1), //银龙枪
			Array(1432035,300,1), //奥丁手戟
			Array(1432037,300,1), //枫叶大将旗
			Array(1432038,10,1), //盘龙七冲枪
			Array(1432039,300,1), //钓鱼竿
			Array(1432040,300,1), //枫叶钻天枪
			Array(1432041,300,1), //枫叶3年旗
			Array(1432042,300,1), //粉色花边游泳圈
			Array(1432046,10,1), //圣诞树手杖
			Array(1432047,10,1), //永恒显圣枪
			Array(1432048,300,1), //铲子
			Array(1432049,10,1), //重生显圣枪
			Array(1432050,10,1), //圣诞六翼天使武器(枪)
			Array(1442002,300,1), //月灵戟
			Array(1442003,300,1), //斧戟
			Array(1442004,300,1), //拖把
			Array(1442005,300,1), //九龙刀
			Array(1442006,300,1), //蓝铁锤
			Array(1442007,300,1), //幻影
			Array(1442008,300,1), //黄龙刀
			Array(1442009,300,1), //月牙戟
			Array(1442010,300,1), //方天戟
			Array(1442011,300,1), //冲浪板
			Array(1442012,300,1), //天空雪板
			Array(1442013,300,1), //沧海雪板
			Array(1442014,300,1), //银雪板
			Array(1442015,300,1), //黄金雪板
			Array(1442016,300,1), //黑雪板
			Array(1442017,300,1), //赤血雪板
			Array(1442018,10,1), //冻冻鱼
			Array(1442019,300,1), //月神刀
			Array(1442020,300,1), //巨灵开山斧
			Array(1442021,300,1), //黄拖把
			Array(1442022,300,1), //白拖把
			Array(1442023,300,1), //黑拖把
			Array(1442024,300,1), //枫叶矛
			Array(1442025,300,1), //青龙偃月刀
			Array(1442026,300,1), //红色冲浪板
			Array(1442027,300,1), //绿色冲浪板
			Array(1442028,300,1), //蓝色冲浪板
			Array(1442029,300,1), //紫色冲浪板
			Array(1442030,300,1), //枫之雪板
			Array(1442031,300,1), //九龙刀
			Array(1442032,300,1), //方天戟
			Array(1442033,300,1), //黄龙刀
			Array(1442034,300,1), //月神刀
			Array(1442035,300,1), //九龙刀
			Array(1442036,300,1), //方天戟
			Array(1442037,300,1), //黄龙刀
			Array(1442038,300,1), //月神刀
			Array(1442039,300,1), //冻冻鱼
			Array(1442040,300,1), //九龙刀
			Array(1442041,300,1), //方天戟
			Array(1442042,300,1), //黄龙刀
			Array(1442043,300,1), //月神刀
			Array(1442044,300,1), //战魂斗杀戟
			Array(1442045,300,1), //血龙神斧
			Array(1442046,300,1), //超级滑雪板
			Array(1442051,300,1), //枫叶强袭斧
			Array(1442052,300,1), //枫叶3年旗
			Array(1442053,300,1), //粉色花边游泳圈
			Array(1442054,300,1), //红色滑水板
			Array(1442055,300,1), //绿色滑水板
			Array(1442056,300,1), //蓝色滑水板
			Array(1442057,300,1), //紫色滑水板
			Array(1442063,10,1), //永恒神光戟
			Array(1442065,300,1), //蓝色冲浪板
			Array(1442066,300,1), //红色冲浪板
			Array(1442067,10,1), //重生神光戟
			Array(1442069,300,1), //红色冲浪板
			Array(1442070,300,1), //绿色冲浪板
			Array(1442071,10,1), //圣诞六翼天使武器(矛)
			Array(1452000,300,1), //战斗弓
			Array(1452001,300,1), //打猎弓
			Array(1452002,300,1), //长弓
			Array(1452003,300,1), //钢铁弓
			Array(1452004,300,1), //凤凰之弓
			Array(1452005,300,1), //雷电
			Array(1452006,300,1), //火焰之弓
			Array(1452007,300,1), //暴风弓
			Array(1452008,300,1), //天弓
			Array(1452009,300,1), //赤神弓
			Array(1452010,300,1), //青神弓
			Array(1452011,300,1), //黄神弓
			Array(1452012,300,1), //青龙弓
			Array(1452013,300,1), //朱雀弓
			Array(1452014,300,1), //黄虎弓
			Array(1452015,300,1), //玄武弓
			Array(1452016,300,1), //漂云之弓
			Array(1452017,300,1), //魔翼之弓
			Array(1452018,300,1), //天蝎之弓
			Array(1452019,300,1), //天鹰弓(白)
			Array(1452020,300,1), //天鹰弓(黄)
			Array(1452021,300,1), //天鹰弓(黑)
			Array(1452022,300,1), //枫叶弓
			Array(1452023,300,1), //曹家之弓
			Array(1452024,300,1), //绿林弓
			Array(1452025,300,1), //蓝色梅杜斯
			Array(1452026,300,1), //黑色梅杜斯
			Array(1452044,300,1), //金龙振翅弓
			Array(1452045,300,1), //枫叶HAPPY弓
			Array(1452046,300,1), //枫叶3年旗
			Array(1452048,300,1), //粉色花边游泳圈
			Array(1452051,300,1), //初级弓手的弓
			Array(1452057,10,1), //永恒惊电弓
			Array(1452059,10,1), //重生惊电弓
			Array(1452062,10,1), //圣诞六翼天使武器(弓)
			Array(1462000,300,1), //山羊弩
			Array(1462001,300,1), //弩弓
			Array(1462002,300,1), //战斗弩弓
			Array(1462003,300,1), //猎弩弓
			Array(1462004,300,1), //鹰弩
			Array(1462005,300,1), //双弦弩
			Array(1462006,300,1), //白银弩
			Array(1462007,300,1), //炎弩
			Array(1462008,300,1), //黄金弩
			Array(1462014,300,1), //枫叶玉弩
			Array(1462015,300,1), //光圣鹞弩(白)
			Array(1462016,300,1), //金圣鹞弩(黄)
			Array(1462017,300,1), //黑暗圣鹞弩
			Array(1462018,300,1), //红炎神机弩
			Array(1462019,300,1), //枫叶弩
			Array(1462020,300,1), //烈焰之弩
			Array(1462021,300,1), //闇黑弩
			Array(1462022,300,1), //黄色可撒弩
			Array(1462023,300,1), //山羊弩
			Array(1462024,300,1), //炎弩
			Array(1462025,300,1), //黄金弩
			Array(1462026,300,1), //破天弩弓
			Array(1462027,300,1), //黑暗弩弓
			Array(1462028,300,1), //山羊弩
			Array(1462029,300,1), //炎弩
			Array(1462030,300,1), //黄金弩
			Array(1462031,300,1), //破天弩弓
			Array(1462032,300,1), //黑暗弩弓
			Array(1462033,300,1), //山羊弩
			Array(1462034,300,1), //炎弩
			Array(1462035,300,1), //黄金弩
			Array(1462036,300,1), //破天弩弓
			Array(1462037,300,1), //黑暗弩弓
			Array(1462039,300,1), //黄金飞龙弩
			Array(1462040,300,1), //枫叶击星弩
			Array(1462041,300,1), //枫叶3年旗
			Array(1462043,300,1), //粉色花边游泳圈
			Array(1462050,10,1), //永恒冥雷弩
			Array(1462051,10,1), //重生冥雷弩
			Array(1462056,10,1), //圣诞六翼天使武器(弩)
			Array(1472051,300,1), //寒木升龙拳
			Array(1472052,300,1), //碧水落龙拳
			Array(1472053,300,1), //逆龙咆哮拳
			Array(1472054,300,1), //信玄
			Array(1472055,300,1), //枫叶定天拳
			Array(1472056,300,1), //枫叶3年旗
			Array(1472058,300,1), //粉色花边游泳圈
			Array(1472061,300,1), //初级飞侠拳套
			Array(1472063,300,1), //魔法手套
			Array(1472068,10,1), //永恒大悲赋
			Array(1472071,10,1), //重生大悲赋
			Array(1472077,10,1), //圣诞六翼天使武器(拳套)
			Array(1472800,300,1), //黄铜拳套
			Array(1482000,300,1), //指套
			Array(1482001,300,1), //拳甲
			Array(1482002,300,1), //格斗指虎
			Array(1482003,300,1), //三日月冲拳
			Array(1482004,300,1), //全覆式拳甲
			Array(1482005,300,1), //双翼拳甲
			Array(1482006,300,1), //刺棘拳甲
			Array(1482007,300,1), //蛇吻
			Array(1482008,300,1), //列翼拳甲
			Array(1482009,300,1), //强袭拳甲
			Array(1482010,300,1), //破坏者
			Array(1482011,300,1), //三刃雪钩
			Array(1482012,300,1), //剑龙拳甲
			Array(1482013,300,1), //撕裂者
			Array(1482014,300,1), //新手专用指套
			Array(1482015,300,1), //轻型覆拳甲
			Array(1482016,300,1), //轻型蛇吻
			Array(1482017,300,1), //比翼鸟
			Array(1482018,300,1), //突击拳甲
			Array(1482019,300,1), //冲击者
			Array(1482023,10,1), //永恒孔雀翎
			Array(1482024,10,1), //重生孔雀翎
			Array(1482025,300,1), //粉色花边游泳圈
			Array(1482029,10,1), //圣诞六翼天使武器(指节)
			Array(1482030,300,1), //枫叶3年旗
			Array(1492000,300,1), //短枪
			Array(1492001,300,1), //单发手铳
			Array(1492002,300,1), //大型手铳
			Array(1492003,300,1), //突击手铳
			Array(1492004,300,1), //银枪
			Array(1492005,300,1), //红杰克
			Array(1492006,300,1), //黑郁金香
			Array(1492007,300,1), //金钱豹
			Array(1492008,300,1), //速射手铳
			Array(1492009,300,1), //重装手铳
			Array(1492010,300,1), //雷明顿
			Array(1492011,300,1), //鲁格
			Array(1492012,300,1), //金枪
			Array(1492013,300,1), //枭龙
			Array(1492014,300,1), //新手专用短枪
			Array(1492015,300,1), //镀银枪
			Array(1492016,300,1), //猞猁
			Array(1492017,300,1), //急速手铳
			Array(1492018,300,1), //集火手铳
			Array(1492019,300,1), //德林杰
			Array(1492023,10,1), //永恒凤凰铳
			Array(1492025,10,1), //重生凤凰铳
			Array(1492026,300,1), //粉色花边游泳圈
			Array(1492030,10,1), //圣诞六翼天使武器(手枪)
			Array(1492034,300,1), //枫叶3年旗
			Array(1702138,300,1), //大火腿
			Array(1302073,300,1), //新加坡国旗（初学者）
			Array(1302074,300,1), //马来西亚国旗（初学者）
			Array(1302075,300,1), //新加坡国旗（单手剑）
			Array(1302076,300,1), //马来西亚国旗（单手剑）
			Array(1312035,300,1), //新加坡国旗（单手斧）
			Array(1312036,300,1), //马来西亚国旗（单手斧）
			Array(1322057,300,1), //新加坡国旗（单手杖）
			Array(1322058,300,1), //马来西亚国旗（单手杖）
			Array(1332060,300,1), //新加坡国旗（短剑）
			Array(1332061,300,1), //马来西亚国旗（短剑）
			Array(1382043,300,1), //新加坡国旗（长杖）
			Array(1382044,300,1), //马来西亚国旗（长杖）
			Array(1402042,300,1), //新加坡国旗（双手剑）
			Array(1412030,300,1), //新加坡国旗（双手斧）
			Array(1412031,300,1), //马来西亚国旗（双手斧）
			Array(1422034,300,1), //新加坡国旗（双手杖）
			Array(1432043,300,1), //新加坡国旗（枪）
			Array(1432044,300,1), //马来西亚国旗（枪）
			Array(1442058,300,1), //新加坡国旗（矛）
			Array(1452049,300,1), //新加坡国旗（弓）
			Array(1452050,300,1), //马来西亚国旗（弓）
			Array(1462044,300,1), //新加坡国旗（弩）
			Array(1462045,300,1), //马来西亚国旗（弩）
			Array(1472059,300,1), //新加坡国旗（指节）
			Array(1472060,300,1), //马来西亚国旗（指节）
			//------药水------
			Array(2000004,900,20), //特殊药水
			Array(2000005,700,20), //超级药水
			//-----椅子-----
			Array(3010013,20,1), //悠长假期
			Array(3010014,20,1), //月亮弯
			Array(3010018,20,1), //椰子树沙滩椅
			Array(3010019,20,1), //寿司椅
			Array(3010021,20,1), //暖暖桌
			Array(3010025,20,1), //枫叶纪念凳
			Array(3010028,20,1), //海盗的俘虏
			Array(3010029,20,1), //蓝环凳
			Array(3010030,20,1), //黑环凳
			Array(3010031,20,1), //红环凳
			Array(3010032,20,1), //黄环凳
			Array(3010033,20,1), //绿环凳
			Array(3010037,20,1), //猪猪凳
			Array(3010044,20,1), //同一红伞下
			Array(3012001,20,1), //篝火
			Array(3012002,20,1), //浴桶
			Array(3010073,20,1), //PB克缤
			Array(3012003,20,1) //爱心椅子

);
var itemjf=new Array("1122019","1122024","1122025","1132000","1132001","1132002","1142000","1142001","1142002","1142003","1142004","1142005","1142006","1142007","1142008","1142014","1142015","1142016","1142017","1142074","1142151","1142173","1142174","1142175","1142176","1142177","1142178","1142179","1142304","1142189","1142124","1142167");
var itemjfcost=new Array("200","800","800","300","400","500","200","800","600","600","600","1500","2000","1800","1800","800","800","800","800","2000","2000","3000","3000","3000","3000","3000","3000","10000","10000","10000","10000","10000");

var itemgp=new Array("2370001","2370000","1122019","1122024","1122025","1132000","1132001","1132002","1142000","1142001","1142002","1142003","1142004","1142005","1142006","1142007","1142008","1142014","1142015","1142016","1142017","1142074","1142151","1142173","1142174","1142175","1142176","1142177","1142178","1142179","1142304","1142189","1142124","1142167");
var itemgpcost=new Array("20","50","500","1500","1500","800","1200","1800","800","2500","2400","2400","2400","3000","3800","3600","3600","2500","2500","2500","2500","5000","5000","6000","6000","7000","7000","7000","8000","30000","30000","30000","30000","25000");
var chanced = Math.floor(Math.random()*2)+1;

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (status >= 0 && mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			//if (cm.getChar().getGMLevel() >= 50 ) { 
			var iid="[活动]";
			//cm.makeitem2(2340000,0,0,0,0,0,0,0,iid,50);
			//}
			if(chanced>=2){
			cm.mapMessage("[NPC]好消息，庆祝节日的到来，现在开放了充值元宝奖励，充得越多，送得越多哟！");}
			if (cm.getLevel() >= 1 ) {  
				cm.sendSimple("您好，欢迎来到#r轩辕剑冒险岛#k，我是多功能npc:\r\n#b#r#d\r\n#L103##r∝╬═→VIP证明换取GM卷[点击查看详情]#b#l\r\n#L100#∝╬═→VIP证明玩具抽奖[点击查看详情]#l\r\n#L105#∝╬═→VIP证明换取永恒套装[点击查看详情]#l\r\n#L106##r∝╬═→VIP证明椅子抽奖[点击查看详情]#b#l\r\n#L108#∝╬═→VIP证明升级装备次数[点击查看详情]#l\r\n#L107##r∝╬═→我要全属性装备[提高破功PK等伤害必备]#b#l\r\n\r\n");
			} else {
				cm.sendOk("对不起，等级底于130级不给你使用这个NPC");
				cm.dispose();
			}
		} else if (status == 1) {
			if (selection >= 1001) {
				cm.dispose();
			}
			if (selection == 21) {
				typed=212;
						var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
						for(var i = 1;i<=5;i++){
							if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(i)).isFull()){
								cm.sendOk("您至少应该让所有包裹都空出一格");
								cm.dispose();
								return;
							}
						}
						selStr = "能量点获得方法就是站在1线市场泡点，每1分钟会涨1点.20的兵法书直接增加500W经验，50的兵法书直接增加5000W经验.\r\n#r<您目前的能量点为："+cm.getChar().getgodpoint()+" 点>继续努力哟~~#b";
						for (var i = 0; i < itemgp.length; i++) {
							selStr += "\r\n#b#L" + i + "##v" +itemgp[i]+"# 需要 "+itemgpcost[i]+"点能量，#r[点击图片开始换取]#l";
						}
						cm.sendSimple(selStr);
			}
			if (selection == 103) {
				cm.openNpc(9040011);
			}
			if (selection == 100) {
				cm.openNpc(1072002);
			}
			if (selection == 105) {
				cm.openNpc(1072003);
			}
			if (selection == 106) {
				cm.openNpc(1072004);
			}
			if (selection == 108) {
				cm.openNpc(1072005);
			}
			if (selection == 107) {
				cm.openNpc(9310074);
			}
			if (selection == 104) {
				cm.sendOk("站在市场，就能以每分钟1点的值增加，如果你没什么事的时候，比如去吃饭啦，就可以挂在市场，能量点越多，就能换到更好的玩具和装备，不断在更新中哟，记得去看！");
				cm.dispose();
			}
			if (selection == 20) {
				typed=211;
				cm.sendNext("如果你带来了[10张洗能力点卷轴]#v5050000#,我可以将你的所有能力点全部重置为4，在把你其它的点留给你自己加哟，别忘了，加点可以使用命令加的，这是本服特色，如果你还不知道命令，请在聊天窗口输入#b@帮助#k 查询.#r[如果你是高级vip2或者以上级别的是免费的哟]");
			}
			if (selection == 50) {
				cm.sendOk("未知原因，也被管理员关闭，请等待管理员通知开放！");
				cm.dispose();
			}
			if (selection == 51) {
				cm.openNpc(1061100);
			}
			if (selection == 52) {
				cm.openNpc(2060005);
			}
			if (selection == 53) {
				cm.openNpc(9900000);
			}
			if (selection == 54) {
				cm.openNpc(9000009);
			}
			if (selection == 101) {
				typed=202;
						var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
						for(var i = 1;i<=5;i++){
							if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(i)).isFull()){
								cm.sendOk("您至少应该让所有包裹都空出一格");
								cm.dispose();
								return;
							}
						}
						selStr = "请选择你要换取的物品道具.\r\n#r<您目前的积分为："+cm.getjf()+" 分>#b";
						for (var i = 0; i < itemjf.length; i++) {
							selStr += "\r\n#b#L" + i + "##v" +itemjf[i]+"# 需要 "+itemjfcost[i]+"点积分，#r[点击图片开始换取]#l";
						}
						cm.sendSimple(selStr);
			}
			if (selection == 102) {
				cm.sendNext("目前积分获得的方式，仅仅是废弃组队任务获得，我们将会开放更多的任务来增加积分，敬请期待！当然了，加入会员后，每天可领取5点积分！");
				cm.dispose();
				return;
			}
			if (selection == 11) {
				typed=20;
				cm.sendNext("嘿，你转了几转了呀，如果你的转生等级为#r5#k的倍数，就可以来我这里抽奖咯，每转仅限抽一次哟，#b打个比方：你现在5转，那你就有一次抽奖机会，你到10转的时候，你又有一次机会,以此类推..\r\n#k怎么样，来试一次么?我这里的抽奖和飞天猪那里不一样，有机率获得#r+属性攻击项链和腰带和椅子#k哟..\r\n#eLet's GO.....您目前转生: #r"+cm.getChar().getzs()+"#k次");
			}
			if (selection == 8) {
				typed=8;
				cm.sendSimple("请选择你要加入的会员类型:\r\n#e#r购买或升级会员之前请在背包每项至少各留30个空位接受会员物品#n\r\n#L1#二星会员免费#r领取#l\r\n#L2#三星会员需要5W点券#l\r\n#L5#四星会员需要10W点券#l\r\n#L7#五星会员需要15W点券#l\r\n#L9#六星会员需要18W点券(特价)#l\r\n#L6#三星会员升四星会员需要5W点券#l\r\n#L8#四星会员升五星会员需要5W点券#l\r\n#L10#五星会员升六星会员需要3W点券(特价)#l");
			}
			if (selection == 9) {
				  if(cm.getChar().getVip()>0){
					//cm.openNpc(2133001);
                                        cm.warp(180000000);
					//cm.sendOk("尊敬的会员：您的专属地图已经到达！");
					cm.dispose();
					return;
				}else{
					cm.sendOk("对不起，您不是会员！");
					cm.dispose();
					return;
				  }
			}
			if (selection == 10) {
				typed=10;
				cm.sendSimple("请点击查看各星会员介绍:\r\n#e#r本服的会员经验加成可以和双倍经验卡叠加生效,\r\n比如6星会员自身3倍经验,用了双倍卡就是3×2=6倍\r\n#b#L0#初级功能及待遇[0元]#l\r\n#L1#高级vip2功能及待遇[10元]#l\r\n#L2#黄金vip3功能及待遇[30元]#l\r\n#b#L4#至尊vip4功能及待遇[60元]#l\r\n#L5#超级vip5功能及待遇[100元]#l\r\n#L6#顶级vip6功能及待遇[150元]#l\r\n#L3#查看如何办理#l");
			}
			if (selection == 2) {
				cm.openNpc(9000083);
			}
			if (selection == 5) {
				cm.openNpc(1012112);
			}
			if (selection == 0) {
				cm.dispose();
                        }
			if (selection == 1) {
				cm.openNpc(9900000);
			}
		} else if (status == 2) {
			if(typed==8){
				if(selection==0){
					if(cm.getLevel()>=160 && cm.getChar().getVip()<1){
						cm.gainItem(1142178,1);
						cm.getChar().setVip(1);
						var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
						var toDropd = ii.randomizeStats(ii.getEquipById(1142178));
						cm.gainItem(2340000,1);//祝福卷
						cm.serverNotice(5,"[vip公告]：恭喜玩家:"+cm.getChar().getName()+" 加入了本服一星会员行列，欢呼吧！！！");
						cm.serverNotice(5,"[vip公告]：恭喜玩家:"+cm.getChar().getName()+" 加入了本服一星会员行列，欢呼吧！！！");
						cm.serverNotice(5,"[vip公告]：恭喜玩家:"+cm.getChar().getName()+" 加入了本服一星会员行列，欢呼吧！！！");
						cm.serverNotice(5,"[vip公告]：恭喜玩家:"+cm.getChar().getName()+" 加入了本服一星会员行列，欢呼吧！！！");
						cm.serverNotice(5,"[vip公告]：恭喜玩家:"+cm.getChar().getName()+" 加入了本服一星会员行列，欢呼吧！！！");
						cm.sendOk("恭喜您，成功加入[一星会员]");
					}else{
						cm.sendOk("对不起，加入[一星会员]失败，需要120级才能加入哦，如果你没有达到160级，是不能给您办理的哟，或者您已经是[一星会员]了！");
					}
				}else if (selection==1){
				    if(cm.getChar().getNX() >= 0 && cm.getChar().getVip()<2){
					        cm.gainNX(-0);
						cm.getChar().SetVip(2);
						cm.gainItem(3010013,1);
						cm.gainItem(3010034,1);
						cm.gainItem(2000005,500);//超级药水
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1112422;//设置戒指代码
						var shuxing = 100; //设置V2戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(100);
                                        	toDrop.setMp(100);
                                        	toDrop.setMatk(100);
                                       		toDrop.setWatk(100);
                                        	toDrop.setMdef(100);
                                        	toDrop.setWdef(100);
                                        	toDrop.setAcc(100);
                                        	toDrop.setAvoid(100);
                                        	toDrop.setHands(100);
                                        	toDrop.setSpeed(100);
                                        	toDrop.setJump(100);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        	              //cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 免费加入了本服二星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 免费加入了本服二星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 免费加入了本服二星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[二星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，加入[二星会员]失败，请确认你有足够的点券，不够是不能给您办理的哟，或者您已经是[二星会员]了！");
					}
				}else if (selection==2){
				    if(cm.getChar().getNX() >= 50000 && cm.getChar().getVip()<3){
					        cm.gainNX(-50000);
						cm.getChar().SetVip(3);
						cm.gainItem(3010013,1);
						cm.gainItem(3010034,1);
						cm.gainItem(3010035,1);
						cm.gainItem(3010018,1);
						cm.gainItem(5390006,50); //老虎喇叭
						cm.gainItem(2340000,30); //祝福卷
						cm.gainItem(4001374,30); //GM卷30张
						cm.gainItem(4031692,20); //抽奖物品
						cm.gainItem(4031579,2);  //小宝物袋
						cm.gainItem(4031160,30);  //升级勋章
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1112422;//设置戒指代码
						var shuxing = 5000; //设置V4戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(500);
                                        	toDrop.setMp(500);
                                        	toDrop.setMatk(500);
                                       		toDrop.setWatk(500);
                                        	toDrop.setMdef(500);
                                        	toDrop.setWdef(500);
                                        	toDrop.setAcc(500);
                                        	toDrop.setAvoid(500);
                                        	toDrop.setHands(500);
                                        	toDrop.setSpeed(500);
                                        	toDrop.setJump(500);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        			//cm.getChar().saveToDB(true);
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1082149;//设置戒指代码
						var shuxing = 500; //设置V4戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(500);
                                        	toDrop.setMp(500);
                                        	toDrop.setMatk(500);
                                        	toDrop.setWatk(500);
                                        	toDrop.setMdef(500);
                                        	toDrop.setWdef(500);
                                        	toDrop.setAcc(500);
                                        	toDrop.setAvoid(500);
                                        	toDrop.setHands(500);
                                        	toDrop.setSpeed(500);
                                        	toDrop.setJump(500);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        		      //cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服三星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服三星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服三星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[三星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，加入[三星会员]失败，请确认你有足够的点券，不够是不能给您办理的哟，或者您已经是[三星会员]了！");
					}
				}else if (selection==5){
				    if(cm.getChar().getNX() >= 100000 && cm.getChar().getVip()<4){
						cm.gainNX(-100000);
						cm.getChar().SetVip(4);
						cm.gainItem(3010013,1);
						cm.gainItem(3010034,1);
						cm.gainItem(3010035,1);
						cm.gainItem(3010018,1);
						cm.gainItem(1032081,1);
						cm.gainItem(1132037,1);
						cm.gainItem(1122082,1);
						cm.gainItem(1482108,1);//以下是100级传说
						cm.gainItem(1422077,1);
						cm.gainItem(1412075,1);
						cm.gainItem(1452135,1);
						cm.gainItem(1342045,1);
						cm.gainItem(3010013,1);
						cm.gainItem(3010034,1);
						cm.gainItem(3010035,1);
						cm.gainItem(3010018,1);
						cm.gainItem(5390006,100); //老虎喇叭
						cm.gainItem(2340000,50); //祝福卷
						cm.gainItem(4001374,50); //GM卷50张
						cm.gainItem(4031692,30); //抽奖物品
						cm.gainItem(4031579,3);  //小宝物袋
						cm.gainItem(4031160,50);  //升级勋章
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1112422;//设置戒指代码
						var shuxing = 8888; //设置V4戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(1000);
                                        	toDrop.setMp(1000);
                                        	toDrop.setMatk(1000);
                                       		toDrop.setWatk(1000);
                                        	toDrop.setMdef(1000);
                                        	toDrop.setWdef(1000);
                                        	toDrop.setAcc(1000);
                                        	toDrop.setAvoid(1000);
                                        	toDrop.setHands(1000);
                                        	toDrop.setSpeed(1000);
                                        	toDrop.setJump(1000);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        			//cm.getChar().saveToDB(true);
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1082149;//设置戒指代码
						var shuxing = 888; //设置V4戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(888);
                                        	toDrop.setMp(888);
                                        	toDrop.setMatk(888);
                                        	toDrop.setWatk(888);
                                        	toDrop.setMdef(888);
                                        	toDrop.setWdef(888);
                                        	toDrop.setAcc(888);
                                        	toDrop.setAvoid(888);
                                        	toDrop.setHands(888);
                                        	toDrop.setSpeed(888);
                                        	toDrop.setJump(888);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        		      //cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服四星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服四星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服四星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[四星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，加入[四星会员]失败，请确认你有足够的点券，不够是不能给您办理的哟，或者您已经是[四星会员]了！");
					}
				}else if (selection==7){
				    if(cm.getChar().getNX() >= 150000 && cm.getChar().getVip()<5){
						cm.gainNX(-150000);
						cm.getChar().SetVip(5);
						cm.gainItem(3010013,1);
						cm.gainItem(3010034,1);
						cm.gainItem(3010035,1);
						cm.gainItem(3010018,1);
						cm.gainItem(3010061,1);
						cm.gainItem(3010025,1);
						cm.gainItem(3994106,1);
						cm.gainItem(3010037,1);
						cm.gainItem(3010094,1);
						cm.gainItem(3010093,1);
						cm.gainItem(1482109,1);//以下是110级传说
						cm.gainItem(1422078,1);
						cm.gainItem(1412076,1);
						cm.gainItem(1452136,1);
						cm.gainItem(1342046,1);
						cm.gainItem(1372106,1);
						cm.gainItem(1442143,1);
						cm.gainItem(1432106,1);
						cm.gainItem(1312077,1);
						cm.gainItem(1302179,1);
						cm.gainItem(1402118,1);//以上是110级传说
						cm.gainItem(5390006,120); //老虎喇叭
						cm.gainItem(2340000,70); //祝福卷
						cm.gainItem(4001374,70); //GM卷50张
						cm.gainItem(4031692,35); //抽奖物品
						cm.gainItem(4031579,5);  //小宝物袋
						cm.gainItem(4031160,70);  //升级勋章
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1112422;//设置戒指代码
						var shuxing = 9999; //设置V5戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(1500);
                                        	toDrop.setMp(1500);
                                        	toDrop.setMatk(1500);
                                       		toDrop.setWatk(1500);
                                        	toDrop.setMdef(1500);
                                        	toDrop.setWdef(1500);
                                        	toDrop.setAcc(1500);
                                        	toDrop.setAvoid(1500);
                                        	toDrop.setHands(1500);
                                        	toDrop.setSpeed(1500);
                                        	toDrop.setJump(1500);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        			//cm.getChar().saveToDB(true);
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1082149;//设置戒指代码
						var shuxing = 999; //设置V5戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(999);
                                        	toDrop.setMp(999);
                                        	toDrop.setMatk(999);
                                        	toDrop.setWatk(999);
                                        	toDrop.setMdef(999);
                                        	toDrop.setWdef(999);
                                        	toDrop.setAcc(999);
                                        	toDrop.setAvoid(999);
                                        	toDrop.setHands(999);
                                        	toDrop.setSpeed(999);
                                        	toDrop.setJump(999);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        		      //cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服五星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服五星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服五星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[五星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，加入[五星会员]失败，请确认你有足够的点券，不够是不能给您办理的哟，或者您已经是[五星会员]了！");
					}
				}else if (selection==9){
				    if(cm.getChar().getNX() >= 180000 && cm.getChar().getVip()<6){
						cm.gainNX(-180000);
						cm.getChar().SetVip(6);
						cm.gainItem(3010013,1);
						cm.gainItem(3010034,1);
						cm.gainItem(3010035,1);
						cm.gainItem(3010018,1);
						cm.gainItem(3010061,1);
						cm.gainItem(3010025,1);
						cm.gainItem(3994106,1);
						cm.gainItem(3010037,1);
						cm.gainItem(3010094,1);
						cm.gainItem(1452106,1);
						cm.gainItem(2340000,100);
						cm.gainItem(1482109,1);//以下是110级传说
						cm.gainItem(1422078,1);
						cm.gainItem(1412076,1);
						cm.gainItem(1452136,1);
						cm.gainItem(1342046,1);
						cm.gainItem(1402118,1);//以上是110级传说
						cm.gainItem(1002702,1);//传说头巾
						cm.gainItem(1102319,1);//传说心跳气球
						cm.gainItem(1112668,1);//传说戒指
						cm.gainItem(5390006,150); //老虎喇叭
						cm.gainItem(2340000,80); //祝福卷
						cm.gainItem(4001374,80); //GM卷50张
						cm.gainItem(4031692,50); //抽奖物品
						cm.gainItem(4031579,6);  //小宝物袋
						cm.gainItem(4031160,80);  //升级勋章
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1112422;//设置戒指代码
						var shuxing = 10888; //设置V6戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(2000);
                                        	toDrop.setMp(2000);
                                        	toDrop.setMatk(2000);
                                       		toDrop.setWatk(2000);
                                        	toDrop.setMdef(2000);
                                        	toDrop.setWdef(2000);
                                        	toDrop.setAcc(2000);
                                        	toDrop.setAvoid(2000);
                                        	toDrop.setHands(2000);
                                        	toDrop.setSpeed(2000);
                                        	toDrop.setJump(2000);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        			//cm.getChar().saveToDB(true);
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1082149;//设置戒指代码
						var shuxing = 999; //设置V6戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(999);
                                        	toDrop.setMp(999);
                                        	toDrop.setMatk(999);
                                        	toDrop.setWatk(999);
                                        	toDrop.setMdef(999);
                                        	toDrop.setWdef(999);
                                        	toDrop.setAcc(999);
                                        	toDrop.setAvoid(999);
                                        	toDrop.setHands(999);
                                        	toDrop.setSpeed(999);
                                        	toDrop.setJump(999);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        		      //cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服六星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服六星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服六星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[六星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，加入[六星会员]失败，请确认你有足够的点券，不够是不能给您办理的哟，或者您已经是[六星会员]了！");
					}
				}else if (selection==11){//2升3星
				    if(cm.getChar().getNX() >= 30000 && cm.getChar().getVip()==2){
						cm.gainNX(-30000);
						cm.getChar().SetVip(3);
							cm.gainItem(3010061,1);
							cm.gainItem(3010025,1);
							cm.gainItem(1092076,1);
							cm.gainItem(1372075,1);
							cm.gainItem(1402087,1);
							cm.gainItem(2340000,15);//祝福卷
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服三星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服三星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服三星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[三星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，升级到[三星会员]失败，需要3万点券，如果你没有这么多，是不能给您办理的哟，或者您不是[三星会员]了！");
					}
				}else if (selection==6){//3升4星
				    if(cm.getChar().getNX() >= 50000 && cm.getChar().getVip()==3){
						cm.gainNX(-50000);
						cm.getChar().SetVip(4);
						cm.gainItem(3994106,1);
						cm.gainItem(3010037,1);
						cm.gainItem(1452106,1);
						cm.gainItem(1342031,1);
						cm.gainItem(1382097,1);
						cm.gainItem(1402088,1);
						cm.gainItem(5390006,50); //老虎喇叭
						cm.gainItem(2340000,20); //祝福卷
						cm.gainItem(4001374,20); //GM卷50张
						cm.gainItem(4031692,10); //抽奖物品
						cm.gainItem(4031579,1);  //小宝物袋
						cm.gainItem(4031160,20);  //升级勋章
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1112422;//设置戒指代码
						var shuxing = 3000; //设置V5戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(500);
                                        	toDrop.setMp(500);
                                        	toDrop.setMatk(500);
                                       		toDrop.setWatk(500);
                                        	toDrop.setMdef(500);
                                        	toDrop.setWdef(500);
                                        	toDrop.setAcc(500);
                                        	toDrop.setAvoid(500);
                                        	toDrop.setHands(500);
                                        	toDrop.setSpeed(500);
                                        	toDrop.setJump(500);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        			//cm.getChar().saveToDB(true);
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1082149;//设置戒指代码
						var shuxing = 333; //设置V5戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(333);
                                        	toDrop.setMp(333);
                                        	toDrop.setMatk(333);
                                        	toDrop.setWatk(333);
                                        	toDrop.setMdef(333);
                                        	toDrop.setWdef(333);
                                        	toDrop.setAcc(333);
                                        	toDrop.setAvoid(333);
                                        	toDrop.setHands(333);
                                        	toDrop.setSpeed(333);
                                        	toDrop.setJump(333);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        		      //cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服四星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服四星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服四星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[四星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，升级到[四星会员]失败，需要5万点券，如果你没有这么多，是不能给您办理的哟，或者您不是[三星会员]了！");
					}
				}else if (selection==8){//4升5星
				    if(cm.getChar().getNX() >= 50000 && cm.getChar().getVip()==4){
						cm.gainNX(-50000);
						cm.getChar().SetVip(5);
						cm.gainItem(3010094,1);
						cm.gainItem(3010093,1);
						cm.gainItem(1432080,1);
						cm.gainItem(1442110,1);
						cm.gainItem(1462090,1);
						cm.gainItem(5390006,20); //老虎喇叭
						cm.gainItem(2340000,20); //祝福卷
						cm.gainItem(4001374,20); //GM卷50张
						cm.gainItem(4031692,15); //抽奖物品
						cm.gainItem(4031579,2);  //小宝物袋
						cm.gainItem(4031160,20);  //升级勋章
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1112422;//设置戒指代码
						var shuxing = 1111; //设置V5戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(500);
                                        	toDrop.setMp(500);
                                        	toDrop.setMatk(500);
                                       		toDrop.setWatk(500);
                                        	toDrop.setMdef(500);
                                        	toDrop.setWdef(500);
                                        	toDrop.setAcc(500);
                                        	toDrop.setAvoid(500);
                                        	toDrop.setHands(500);
                                        	toDrop.setSpeed(500);
                                        	toDrop.setJump(500);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        			//cm.getChar().saveToDB(true);
						//属性勋章 1142134- 冒险岛漫画家勋章 
						var xnzhang = 1082149;//设置戒指代码
						var shuxing = 111; //设置V5戒指属性.
						var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
						toDrop.setLocked(1); //替装备加锁
		        			toDrop.setStr(shuxing);
		        			toDrop.setDex(shuxing);
		        			toDrop.setInt(shuxing);
		        			toDrop.setLuk(shuxing);
                                        	toDrop.setHp(111);
                                        	toDrop.setMp(111);
                                        	toDrop.setMatk(111);
                                        	toDrop.setWatk(111);
                                        	toDrop.setMdef(111);
                                        	toDrop.setWdef(111);
                                        	toDrop.setAcc(111);
                                        	toDrop.setAvoid(111);
                                        	toDrop.setHands(111);
                                        	toDrop.setSpeed(111);
                                        	toDrop.setJump(111);
		        			toDrop.setLocked(1);					
						net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        		        //cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服五星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服五星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服五星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[五星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，升级到[五星会员]失败，需要5万点券，如果你没有这么多，是不能给您办理的哟，或者您不是[四星会员]了！");
					}
				}else if (selection==10){//5升6星
				    if(cm.getChar().getNX() >= 30000 && cm.getChar().getVip()==5){
						cm.gainNX(-30000);
						cm.getChar().SetVip(6);
							cm.gainItem(3012001,1);
							cm.gainItem(3012010,1);
							cm.gainItem(3012003,1);
							cm.gainItem(1002702,1);//传说头巾
							cm.gainItem(1102319,1);//传说心跳气球
							cm.gainItem(1112668,1);//传说戒指
							cm.gainItem(5390006,50); //老虎喇叭
							cm.gainItem(2340000,10); //祝福卷
							cm.gainItem(4001374,10); //GM卷50张
							cm.gainItem(4031692,20); //抽奖物品
							cm.gainItem(4031579,1);  //小宝物袋
							cm.gainItem(4031160,10);  //升级勋章
							//属性勋章 1142134- 冒险岛漫画家勋章 
							var xnzhang = 1112422;//设置戒指代码
							var shuxing = 889; //设置V6戒指属性.
							var toDrop = new net.sf.odinms.client.Equip(xnzhang,0);
							toDrop.setLocked(1); //替装备加锁
		        				toDrop.setStr(shuxing);
		        				toDrop.setDex(shuxing);
		        				toDrop.setInt(shuxing);
		        				toDrop.setLuk(shuxing);
                                        		toDrop.setHp(500);
                                        		toDrop.setMp(500);
                                        		toDrop.setMatk(500);
                                       			toDrop.setWatk(500);
                                        		toDrop.setMdef(500);
                                        		toDrop.setWdef(500);
                                        		toDrop.setAcc(500);
                                        		toDrop.setAvoid(500);
                                        		toDrop.setHands(500);
                                        		toDrop.setSpeed(500);
                                        		toDrop.setJump(500);
		        				toDrop.setLocked(1);					
							net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, -1);
		        				//cm.getChar().saveToDB(true);
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服六星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服六星会员行列，欢呼吧！！！",true).getBytes());
            cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.serverNotice(17,cm.getC().getChannel(),"[vip公告]" + " : 恭喜玩家：" + cm.getPlayer().getName() +" 加入了本服六星会员行列，欢呼吧！！！",true).getBytes());
						cm.sendOk("恭喜您，成功加入[六星会员]，祝您游戏愉快！");
					}else{
						cm.sendOk("对不起，升级到[六星会员]失败，需要3万点券，如果你没有这么多，是不能给您办理的哟，或者您不是[五星会员]了！");
					}
				}
				cm.dispose();
				return;
			}
			if(typed==10){
				if(selection==0){
					cm.sendNext("#r办理一星会员送的东西如下：\r\n#b1.会员独有个性勋章\r\n2.会员市场双倍泡点+升级6点能力值\r\n3.1.5倍PK攻击\r\n4.200W破攻\r\n5.会员免费更换所有发型\r\n6.会员专用练级地图[1]\r\n7.会员每天工资：\r\n#r1000万冒险币+1000点券+500元宝+3种情景喇叭各1个+5个超级经验兵书[使用1个可直接获得5000万经验]！\r\n#b8.购买会员即赠送：\r\n#r会员勋章1个+5000点券+5000元宝+5张祝福卷+椅子一把");
				}else if (selection==1){
					cm.sendNext("#r办理高级vip2送的东西如下：\r\n#b1.会员独有个性勋章\r\n2.会员市场三倍泡点+升级7点能力值\r\n3.1.5倍PK攻击+1.2倍经验加成\r\n4.500W破攻\r\n5.会员专用练级地图[2]\r\n6.会员每天工资：\r\n#r3000万冒险币+2000点券+600元宝+50能量点+3种情景喇叭各2个+10个超级经验兵书[使用1个可直接获得5000万经验]！\r\n#b7.购买会员即赠送：\r\n#r会员勋章1个+10000点卷+1万元宝+10张祝福卷+3种稀有椅子\r\n110级职业装备一套+19件80级传奇装备");
				}else if (selection==2){
					cm.sendNext("#r办理黄金vip3送的东西如下：\r\n#b1.会员独有个性勋章\r\n2.会员市场四倍泡点+升级8点能力值\r\n3.2倍PK攻击+1.5倍经验加成\r\n4.5000W破攻\r\n5.会员专用练级地图[3]\r\n6.会员每天工资：\r\n#r1E冒险币+3000点券+800元宝+100能量点+5点积分+3种情景喇叭各3个+20个超级经验兵书[使用1个可直接获得5000万经验]\r\n#b7.购买会员即赠送：\r\n#r20000点卷+2万元宝+20张祝福卷+5种稀有椅子+狼神坐骑：  剑士 宝座  悠长假期  月亮弯  粉色海狗靠垫  寿司椅+4种稀有玩具：  枫叶庆典旗  冒险岛伞    枫叶旗  冻冻鱼  120级职业装备一套+19件90级传奇装备");
				}else if (selection==4){
					cm.sendNext("#r办理至尊vip4送的东西如下：\r\n#b1.会员独有个性勋章\r\n2.会员市场五倍泡点+升级9点能力值\r\n3.2倍PK攻击+2倍经验加成\r\n4.1E破攻\r\n5.会员专用练级地图[4]\r\n6.会员每天工资：\r\n#r2E冒险币+4000点券+1000元宝+150能量点+6点积分+3种情景喇叭各4个+30个超级经验兵书[使用1个可直接获得5000万经验]\r\n#b7.购买即赠送：\r\n#r会员勋章1个+30000点卷+3万元宝+30张祝福卷+3种稀有椅子+5款二代不速之客武器+19件100级传奇装备");
				}else if (selection==5){
					cm.sendNext("#r办理超级vip5送的东西如下：\r\n#b1.会员独有个性勋章\r\n2.会员市场六倍泡点+升级10点能力值\r\n3.2.5倍PK攻击+2.5倍经验加成\r\n4.5E破攻\r\n5.会员专用练级地图[5]\r\n6.会员每天工资：\r\n#r5E冒险币+5000点券+1200元宝+150能量点+8点积分+3种情景喇叭各5个+40个超级经验兵书[使用1个可直接获得5000万经验]\r\n#b7.购买即赠送：\r\n#r会员勋章1个+50000点卷+5万元宝+50张祝福卷+3种稀有椅子+6款末代不速之客武器+2款090新椅子+19件110级传奇装备");
				}else if (selection==6){
					cm.sendNext("#r办理顶级vip6送的东西如下：\r\n#b1.VIP6专属勋章\r\n2.会员市场七倍泡点+升级11点能力值\r\n3.2.5倍PK攻击+3倍经验加成\r\n4.20E破攻\r\n5.会员专用练级地图[6]\r\n6.会员每天工资：\r\n#r8E冒险币+6000点券+1500元宝+200能量点+10点积分+3种情景喇叭各6个+50个超级经验兵书[使用1个可直接获得5000万经验]\r\n#b7.购买即赠送：\r\n#r80000点卷+8万元宝+100张祝福卷+6款末代不速之客武器+4款\r\n090新椅子+兔子车夫090新骑宠+专属vip6勋章一个+19件110级传奇装备+3件稀有传奇装备");
				}else if (selection==3){
					cm.sendNext("#r为什么要开放会员VIP?\r\n#b为了服务器能长久稳定的发展，开放后人气大大提升，至使服务器承受有限，特开放此功能，有了大家的赞助后，我们可以进一步的升级服务器硬件，让大家能玩到更好更稳定穿越的冒险岛！\r\n#r如何加入VIP会员？\r\n#b打开元宝充值地址：\r\n http://www.xf4060.com/ 然后在帐号处填入您的游戏帐号，充值成功后，就有元宝啦，游戏不用下线也可以哟，在找我谈话申请办理！\r\n#rVIP会员有什么好处？\r\n#b我们的会员都是永久的,加入会员后，享受会员专属权利，每天领高额工资和传送免费等功能，请参考各星会员介绍！");

				}
				cm.dispose();
				return;

			}
			if(typed==211){
				if(cm.getChar().getVip()>=2){
					var statup = new java.util.ArrayList();
					var p = cm.getChar();
					var totAp = p.getRemainingAp() + p.getStr() + p.getDex() + p.getInt() + p.getLuk();
					p.setRemainingAp(totAp-16);
					p.setStr(4);
					p.setDex(4);
					p.setInt(4);
					p.setLuk(4);
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.STR, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.DEX, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.LUK, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.INT, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.AVAILABLEAP, java.lang.Integer.valueOf(p.getRemainingAp())));
					p.getClient().getSession().write (net.sf.odinms.tools.MaplePacketCreator.updatePlayerStats(statup));
					cm.sendOk("恭喜您，重置成功，由于你是会员，本次免费！");
					cm.dispose();
					return;
				}
				if(cm.haveItem(5050000,10)){
					cm.gainItem(5050000,-10);
					var statup = new java.util.ArrayList();
					var p = cm.getChar();
					var totAp = p.getRemainingAp() + p.getStr() + p.getDex() + p.getInt() + p.getLuk();
					p.setRemainingAp(totAp-16);
					p.setStr(4);
					p.setDex(4);
					p.setInt(4);
					p.setLuk(4);
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.STR, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.DEX, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.LUK, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.INT, java.lang.Integer.valueOf(4)));
					statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.AVAILABLEAP, java.lang.Integer.valueOf(p.getRemainingAp())));
					p.getClient().getSession().write (net.sf.odinms.tools.MaplePacketCreator.updatePlayerStats(statup));
					cm.sendOk("恭喜您，重置成功，扣除10张[洗能力点卷轴]！");
					cm.dispose();
					return;
				}else{
					cm.sendOk("对不起，您没有足够的[洗能力点卷轴]，请到商城去购买！");
					cm.dispose();
					return;
				}
			}
			if(typed==212){
				if(cm.getChar().getgodpoint()>=itemgpcost[selection]){
					cm.gainItem(itemgp[selection],1);
					cm.getChar().setgodpoint(-itemgpcost[selection]);
					cm.sendOk("恭喜您，兑换成功，扣除:"+itemgpcost[selection]+"点能量点！");
					cm.dispose();
					return;
				}else{
					cm.sendOk("对不起，您没有足够的能量点，能量点只能在市场站着泡点获得！");
					cm.dispose();
					return;
				}
			}
			if(typed==202){
				if(cm.getjf()>=itemjfcost[selection]){
					cm.gainItem(itemjf[selection],1);
					cm.setjf(-itemjfcost[selection]);
					cm.sendOk("恭喜您，兑换成功，扣除:"+itemjfcost[selection]+"点积分！");
					cm.dispose();
					return;
				}else{
					cm.sendOk("对不起，您没有足够的积分，积分可通过一些任务获得！");
					cm.dispose();
					return;
				}
			}
			if(typed==20){
					var str = (cm.getChar().getzs()/5);
					if(cm.getChar().getzs()==0){
						cm.sendOk("你目前的转生等级除以5不能整除，请在5，10，15，20....这些转生等级来抽奖，谢谢");
								cm.dispose();
								return;
					}
					var stred=str.toString();
					if(stred.split(".").length==1){
						if(cm.getBossLog(cm.getChar().getzs()+"ZS")>=1){
							cm.sendOk("对不起，您目前的转生等级已经抽过奖了！");
							cm.dispose();
							return;
						}
						var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
						for(var i = 1;i<=5;i++){
							if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(i)).isFull()){
								cm.sendOk("您至少应该让所有包裹都空出一格");
								cm.dispose();
								return;
							}
						}
						var chance = Math.floor(Math.random()*1000);
						var finalitem = Array();
						for(var i = 0 ;i<item.length;i++){
							if(item[i][1] >= chance){
								finalitem.push(item[i]);
							}
						}
						if(finalitem.length != 0){
							var random = new java.util.Random();
							var finalchance = random.nextInt(finalitem.length);
							var itemId = finalitem[finalchance][0];
							var quantity = finalitem[finalchance][2];
							if(ii.getInventoryType(itemId).getType() == 1){
								var toDrop = ii.randomizeStats(ii.getEquipById(itemId));
							}else{
								var toDrop = new net.sf.odinms.client.Item(itemId, 0, quantity);
							}
							net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop);
							cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null,net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "通过转生抽奖功能获得，大家恭喜它！！！",toDrop, true).getBytes());
							
							cm.sendOk("希望你下次再来哦哈哈！");
							cm.setBossLog(cm.getChar().getzs()+"ZS");
							cm.dispose();
						}else{
							cm.sendOk("哎呀……你RP差到什么都没拿到！过段时间再来吧！");
							cm.setBossLog(cm.getChar().getzs()+"ZS");
							cm.dispose();
						}
					}else{
						cm.sendOk("你目前的转生等级除以5不能整除，请在5，10，15，20....这些转生等级来抽奖，谢谢！");
						cm.dispose();
					}
					return;
			}
			var yubao=(cm.getChar().getzs()+1)*1000;
			if(cm.getChar().getzs()>=50){
			yubao=50000;
			}
			if(cm.getzb()>=yubao){
				cm.sendSimple("元宝已经成功扣除，请选择你要转的职业#b\r\n#L0#新手#l\r\n#L1#初心者#l\r\n#L2#战童#l");
			}else{
				cm.sendOk("#b对不起，你没有足够的元宝★控制目前来看，你需要"+yubao+"个元宝");    
				cm.dispose();
				return;
			}
			
			
		} else if (status == 3) {
			if(cm.getChar().getzs()>=50){
				cm.setzb(-50000);
			}else{
				cm.setzb(-(cm.getChar().getzs()+1)*1000);
			}
			var statup = new java.util.ArrayList();
				var p = cm.getChar();
				var totAp = (cm.getChar().getzs()+1)*100+100;
				cm.getChar().setzs(cm.getChar().getzs()+1);
				p.setLevel(1);
				var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
				var toDrop = ii.randomizeStats(ii.getEquipById(4001129));
			if (selection == 0) {
				cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "成功进行了一次转世轮回变为新手，大家祝贺它吧！！！",toDrop, true).getBytes());
			//cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★\r\n#e#r请小退一次 否则被系统误封自己负责"); 
				cm.changeJob(net.sf.odinms.client.MapleJob.BEGINNER);
			}
			if (selection == 1) {
				cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "成功进行了一次转世轮回变为初心者，大家祝贺它吧！！！",toDrop, true).getBytes());
			//cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★\r\n#e#r请小退一次 否则被系统误封自己负责"); 
				cm.changeJob(net.sf.odinms.client.MapleJob.KNIGHT);
			}
			if (selection == 2) {
				cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "成功进行了一次转世轮回变为战童，大家祝贺它吧！！！",toDrop, true).getBytes());
			//cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★\r\n#e#r请小退一次 否则被系统误封自己负责"); 
				cm.changeJob(net.sf.odinms.client.MapleJob.Ares);
			}
				p.setRemainingAp(totAp);
				p.setStr(4);
				p.setDex(4);
				p.setInt(4);
				p.setLuk(4);
				p.setExp(0);
				statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.STR, java.lang.Integer.valueOf(4)));
	statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.DEX, java.lang.Integer.valueOf(4)));
	statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.LUK, java.lang.Integer.valueOf(4)));
	statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.INT, java.lang.Integer.valueOf(4)));
	statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.EXP, java.lang.Integer.valueOf(0)));
	statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.AVAILABLEAP, java.lang.Integer.valueOf(p.getRemainingAp())));
	p.getClient().getSession().write (net.sf.odinms.tools.MaplePacketCreator.updatePlayerStats(statup));
				//cm.serverNotice("[转生系统]伟大的"+cm.getChar().getName()+"成功进行了一次转世轮回，掌声鼓励..");
				cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★"); 
				cm.getChar().levelUp();   
				cm.dispose();
			
		} else if (status == 4) {
			
			cm.dispose();
		}
	}
}
