//皇家整容券
var status = -1;
var facetype;
var card = 5152053;

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0 && status == 0) {
	cm.dispose();
	return;
    }
    if (mode == 1)
	status++;
    else
	status--;
    if (status == 0) {
	cm.sendNext("你好哦！如果你有 #b#z"+card+"##k。我就可以帮你整容。[PS:部分是限量版的哦~~在普通店里找不到的哦~]");
    } else if (status == 1) {
	var face = cm.getPlayerStat("FACE");
	var facetype;

	if (cm.getPlayerStat("GENDER") == 0) {
	     facetype = [20000,20001,20002,20003,20004,20005,20006,20007,20008,20009,20010,20011,20012,20013,20014,20015,20016,20017,20018,20019,20020,20021,20022,20023,20025,20026,20027,20028,20828,20827,20818,20812,20728,20727,20726,20725,20722,20821,20714,20129,20030,20033,20032,20037,20043,20044,20045,20046,20047,20035,20036,20036,20035,20047,20046,20045,20044,20043,20057,20033];
	} else {
	    facetype = [21000,21001,21002,21003,21004,21005,21006,21007,21008,21009,21010,21011,21012,21013,21014,21015,21016,21017,21018,21019,21020,21021,21022,21023,21025,21026,21124,21028,21028,21030,21031,21035,21035,21041,21042,21043,21044,21045,21033,21034,21034,21033,21045,21044,21043,21042,21041,21835,21055,21746,21746,21031,21030,21028];
	}
	/*for (var i = 0; i < facetype.length; i++) {
	    facetype[i] = facetype[i] + face % 1000 - (face % 100);
	}
	*/
	if (cm.setRandomAvatar(card, facetype) == 1) {
	    cm.sendOk("#e好了,你的朋友们一定认不出你了!");
	} else {
	    cm.sendOk("看起来你并没有我们的会员卡,我恐怕不能给你理发,我很抱歉.请你先购买吧.");
	}
	cm.dispose();
    }
}
