/* ===========================================================
			注释(cm.sendSimple\cm.itemQuantity(5420008))
	脚本类型: 		QUEST
	脚本名字:		邪摩斯找回的记忆
	完成任务函数：qm.forceCompleteQuest();
	接受任务函数：qm.forceStartQuest();
=============================================================
制作时间：2010年9月12日 22:39:21
制作人员：笔芯
=============================================================
*/
var a = -1;

function start(mode, type, selection) {//接任务
	if (mode == -1) {
		qm.dispose();
	} else {
		if (mode == 1)
			a++;
		else
			a--;
			if(a == -1){
				qm.dispose();
			}else if (a == 0) {
				qm.sendYesNo("上次你帮我找到的日记本帮了我的大忙。现在我知道了一些和自己有关的事。但是我的精神还是很不稳定。现在精神虽然很正常，但不知道什么时候又会忘记。如果日记本上的内容，以及我隐约想起来的事情是对的的话，应该会有非常危险的事情发生。我需要你的帮助。快来找我，朋友。")
			}else if ( a == 1){
				qm.sendNext("朋……朋友？什么时候和邪摩斯变成朋友了啊？我还不知道邪摩斯到底想干什么呢。我能相信他吗？不管怎样，有时间的话，先去见见邪摩斯吧。")
				qm.forceStartQuest();
				qm.dispose();
		}//status
	}//mode
}//function
